In [2]:
import pandas as pd
import numpy as np

In [3]:
np.random.seed(0)
col=['kor','eng','art','math','gym','sci']
index=['jim','sam','tom','tim','bob']
data=np.random.randint(70,100,size=(5,6))
df=pd.DataFrame(data,index,columns=col)
df

     kor  eng  art  math  gym  sci
jim   82   85   91    70   73   97
sam   73   77   79    89   91   88
tom   74   93   76    94   94   82
tim   96   71   76    77   93   84
bob   94   87   75    95   83   78

[과제] iloc, loc를 이용해서 아래 요구사항들을 출력하세요
- df의 kor열을 series와 dataframe을 각각 출력
- df에서 sam의 math 점수를 출력 (2가지 방법)
- df에서 tom의 eng와 sci 점수를 출력 (2가지 방법)
- df에서 jim, tim의 eng, gym 점수를 출력
- df에서 jim, sam의 art, math, gym 점수를 출력

In [10]:
#df의 kor열을 series와 dataframe을 각각 출력
k_s=df.loc[:,'kor']
k_d=df.iloc[:,0]
print(k_s,type(k_s))
print(k_d,type(k_d))

jim    82
sam    73
tom    74
tim    96
bob    94
Name: kor, dtype: int32 <class 'pandas.core.series.Series'>
jim    82
sam    73
tom    74
tim    96
bob    94
Name: kor, dtype: int32 <class 'pandas.core.series.Series'>

[과제] iloc, loc를 이용해서 아래 요구사항들을 출력하세요
- df에서 sam의 math 점수를 100으로 변경
- df에서 tom의 eng와 math 점수를 100으로 변경
- df에서 jim, tim의 kor, gym 점수를 null값으로 변경
- df에서 math와 gym 점수를 바꾸어 출력

[과제] 데이터 추출(인덱싱, 조건), 변경, 삭제, 정렬, 칼럼 병합(sibsp + parch = family) 등을 수행하여 데이터에서 인사이트를 찾아보세요.

- survived : 생존여부
- pclass : 등급
- sex : 성별
- age : 나이
- sibsp : 탑승한 형제/배우자 수
- parch : 탑승한 부모/자녀 수
- fare : 승객 지불 요금
- embarked : 승선항 (C = 쉘 부르그, Q = 퀸즈타운, S = 사우스 햄튼)
- adult_male : 성인 남성 여부
- deck : 플랫폼 번호
- alive : 생존 여부
- alone : 혼자 여부

In [ ]:
import seaborn as sns
df=sns.load_dataset('titanic')
df